app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all.order(created_at: :desc)
---
SELECT `recipes`.* FROM `recipes` ORDER BY `recipes`.`created_at` DESC

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO `recipes` (`name`, `ingredients`, `instructions`, `prep_time`, `cook_time`, `servings`, `category`, `created_at`, `updated_at`) VALUES ('Postman Test Pasta', 'Pasta\nTomato Sauce\nCheese', '1. Boil water.\n2. Cook pasta.\n3. Eat.', 15, 20, 2, 'Main Course', '2025-12-16 13:13:08.475180', '2025-12-16 13:13:08.475180')

  def update
    if @recipe.update(recipe_params)
---
UPDATE `recipes` SET `recipes`.`servings` = 4, `recipes`.`updated_at` = '2025-12-16 13:03:58.765177' WHERE `recipes`.`id` = 1

  def destroy
    @recipe.destroy
---
DELETE FROM `recipes` WHERE `recipes`.`id` = 22

    def set_recipe
      @recipe = Recipe.find(params[:id])
---
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 3 LIMIT 1